{
  "main": {
    "name":"Susmitha Anandarao",
    "occupation":"Senior Full Stack Engineer",
    "description":" with over 7 years of professional experience",
    "image":"profilepic.jpg",
    "bio":"Backend developer with a Master's degree from The University of Texas at Arlington in Computer Science with over 7 years of experience. Seeking to solve complex business challenges. Proficient in Java, C#, Entity Framework, RESTful web services, and Microsoft SQL Server. Currently exploring Node.js. Looking to expand my leadership skills as I sail through my tech journey.",
    "contactmessage":"Feel free to leave your message and I will gt back to you at my earliest.",
    "email": "susmitha.anandarao@gmail.com",
    "phone": "682-240-3085",
    "address":{
      "street":"10300 Katy Fwy",
      "city":"Houston",
      "state":"Texas",
      "zip": "77043"
    },
    "website": "https://susmitha-anandarao.github.io/me/",
    "resumedownload":"/SusmithaResume.pdf",
    "social":[
      {
        "name":"twitter",
        "url":"http://twitter.com/susmitha_a",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/susmithaanandarao/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/susmitha-anandarao",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"",
    "education":[
      {
        "school":"The University of Texas at Arlington",
        "degree":"Masters of Science in Computer Science",
        "graduated":"December 2015",
        "description":""
      },
      {
        "school":"Visvesvaraya Technological University (VTU)",
        "degree":"Bachelor of Science in Computer Science",
        "graduated":"July 2012",
        "description":""
      }
    ],
    "work":[
      {
        "company":"ChaiOne Inc",
        "title":"Senior Full Stack Engineer",
        "years":"April 2019 - Present",
        "description":"Developed ERP integrated solutions to digitize enterprise process flows such as field user management, e-commerce, supply chain, and logistics. Established project architecture along with Enterprise architects and ensured it meets client governance standards. Delivered intuitive solutions with highly rated System Usability Scores (SUS) by leveraging behavioral scientists and UI/UX design experts. Configured CI/CD deployment pipelines in Microsoft Azure. Mentored and coached peers on projects on design patterns and general best practices. Technology Used: .Net Framework, Entity Framework, Microsoft Azure Services, Azure development operations, REST services, Bitbucket, JIRA, Confluence, Agile development"
      },
      {
        "company":"Cerner Corporation",
        "title":"Associate Senior Software Engineer",
        "years":"January 2016 - April 2019",
        "description":"Participated in full development lifecycle including providing input for design, testing, troubleshooting and documenting software solutions. Identified process improvements and system enhancements. Conducted stress and load testing. Mentored in the new hire training program, DevCenter, and coached team members. Platform and technologies used: C#, Java, SQL, REST, Docker, Jenkins, Git, Jira, Agile development (Scrum and Kanban), Google Guice, Maven, Crucible"
      },
      {
        "company":"Broadcom Corporation",
        "title":"Technical Intern",
        "years":"June 2014 - December 2014",
        "description":"Developed software functions that access the processor through standard hardware port. Developed software tools used to program internal BIST engine, provided fail data and statistics of faults and automated testing across voltage and frequency points."
      },
      {
        "company":"Mindtree Limited",
        "title":"Software Engineer",
        "years":"September 2012 - June 2013",
        "description":"Making enhancements to existing software with minimal direction for Java, J2EE based applications"
      }
    ],
    "skills":[
      {
        "name":"Git",
        "level":"80%"
      },
      {
        "name":"REST",
        "level":"90%"
      },
      {
        "name":"Entity framework Core",
        "level":"75%"
      },
      {
        "name":"Java",
        "level":"80%"
      },
      {
        "name":"SQL",
        "level":"80%"
      },
      {
        "name":"NodeJs",
        "level":"60%"
      },
      {
        "name":"MongoDB",
        "level":"60%"
      }
    ]
  },
  "portfolio":{
    "projects": [
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Susmitha has been and still is one of my favorite developers to work with. She was not only technically proficient with several development languages, she also excelled at learning new technologies quickly. Combined with her positive attitude and enthusiasm for her work, she was the bedrock of several development teams.",
        "user":"Adam Hwang"
      },
      {
        "text":"Susmitha is an extremely talented software engineer and an excellent technical leader wherever she goes. She is a very strong technical leader, both with direct reports and without, and is a positive influencer on any team. Any software engineering organization would benefit from having Susmitha on their team.",
        "user":"Jake Varness"
      },
      {
        "text":"In my opinion what separates a good developer from a regular developer is this drive to understand the tools that they are using. Susmitha definitely falls in this category. A joy to work with and I will definitely be tracking her down if we have an open position in the future.",
        "user":"Phil Read"
      }
    ]
  }
}
